#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ebench/cloud-infra-personnal-website-actions/runs/run-HB2upw24EtUqcrdm

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
heroku_pipeline.main_pipeline: Refreshing state... [id=a6cd3be2-5c92-4ceb-971e-7998e25ad5b9]
heroku_app.app_prod: Refreshing state... [id=ebench-personal-website-prod]
heroku_pipeline_coupling.coupling_prod: Refreshing state... [id=b6d2e5ed-9140-40c9-aac2-c5d7d7da478e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_addon.papertrail will be created
  + resource "heroku_addon" "papertrail" {
      + app         = "ebench-personal-website-dta"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "papertrail:choklad"
      + provider_id = (known after apply)
    }

  # heroku_addon_attachment.papertrail_attachment will be created
  + resource "heroku_addon_attachment" "papertrail_attachment" {
      + addon_id  = (known after apply)
      + app_id    = "ebench-personal-website-prod"
      + id        = (known after apply)
      + name      = "PAPERTRAIL"
      + namespace = (known after apply)
    }

  # heroku_app.app_staging will be created
  + resource "heroku_app" "app_staging" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_ENVIRONMENT" = "staging"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "ebench-personal-website-dta"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_pipeline_coupling.coupling_staging will be created
  + resource "heroku_pipeline_coupling" "coupling_staging" {
      + app      = (known after apply)
      + app_id   = (known after apply)
      + id       = (known after apply)
      + pipeline = "a6cd3be2-5c92-4ceb-971e-7998e25ad5b9"
      + stage    = "staging"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @elghali97, Action: `pull_request`*